<?php

return [
     /*
     |--------------------------------------------------------------------------
     | Путь до swagger
     |--------------------------------------------------------------------------
     */
    'router' => 'api/doc',

     /*
     |--------------------------------------------------------------------------
     | Middlewares
     |--------------------------------------------------------------------------
     | Посредники которые нужно пройти для получения документации
     */
    'middlewares' => [],

     /*
     |--------------------------------------------------------------------------
     | File disk
     |--------------------------------------------------------------------------
     | Диск на котором будут сохраняться файлы схем
     */
    'file_storage_disk' => 'local',

    'path' => 'api-doc-generator/versions',

     /*
     |--------------------------------------------------------------------------
     | Генерировать схемы после обновления страницы swagger
     |--------------------------------------------------------------------------
     */
    'make_after_reload_page' => env('API_DOC_GENERATOR_MAKE_AFTER_RELOAD_PAGE', false),

     /*
     |--------------------------------------------------------------------------
     | Доступ к документации на prod
     |--------------------------------------------------------------------------
     | Если true будут отображать документацию даже в production среде
     */
    'access_in_prod' => env('API_DOC_GENERATOR_ACCESS_IN_PROD', false),

     /*
     |--------------------------------------------------------------------------
     | Тема swagger
     |--------------------------------------------------------------------------
     | Тема оформления swagger , доступные темы
     | theme-flattop.css
     | theme-feeling-blue.css
     | theme-material.css
     | theme-monokai.css
     | theme-muted.css
     | theme-newspaper.css
     | theme-outline.css
     |
     */
    'swagger-themes' => env('SWAGGER_THEMES'),

     /*
     |--------------------------------------------------------------------------
     | Конфиг для схем
     |--------------------------------------------------------------------------
     | Для каждой схемы можно переопределить свойства. По умолчанию если для схемы не заведены конфиг, то настройки будут
     | браться из массива default. Например, если schema будет
     | 'schema_settings' => [
     |     'default' => [
     |         'title' => env('APP_NAME'),
     |         'description' => '',
     |         'version' => 'v2',
     |         'base_url' => null, // по умолчанию вычисляется автоматически
     |     ],
     |     'v1' => [
     |         'description' => 'Schema v1'
     |     ]
     | ],
     | то все параметры будут использовать из default, кроме description
     |
     */
    'schema_settings' => [
        'default' => [
            'title' => env('APP_NAME'),
            'description' => '',
            'version' => 'v2',
            'base_url' => null, // по умолчанию вычисляется автоматически
        ],
    ],

     'default_response' => \Components\ApiDocGenerator\Factories\DefaultResponse::class,
];